In [1]:
import pandas as pd

In [3]:
df=pd.DataFrame({
  'city': ['NewYork','London','Paris','Copenhagen','Chennai','Paris','London','Copenhagen','California','NewYork','Copenhagen'],
  'price':[200,150,278,120,220,250,175,266,197,198,283]
})
df.head()

         city  price
0     NewYork    200
1      London    150
2       Paris    278
3  Copenhagen    120
4     Chennai    220

In [4]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [5]:
df['encoded']=df['city'].map(mean_price)

In [6]:
df

          city  price  encoded
0      NewYork    200    199.0
1       London    150    162.5
2        Paris    278    264.0
3   Copenhagen    120    223.0
4      Chennai    220    220.0
5        Paris    250    264.0
6       London    175    162.5
7   Copenhagen    266    223.0
8   California    197    197.0
9      NewYork    198    199.0
10  Copenhagen    283    223.0